<html><head>                                            
<title>Change Log</title>       
</head>                                                 
<body bgcolor="#FFFCEA" >                        
<DIV></DIV>                                             
<table width="100%"  border="0"  cellspacing="0"  cellpadding="2"  bgcolor="#c0c0c0" >
<tr>                                                    
  <td align="left" >                                    
    <div align="left" ><font face="Arial"  color="#010101"  size="4" ><span style="FONT-SIZE: 14pt"
   >Change Log</span></font></div>  
  </td>                                                 
  <td align="right" >                                   
    <font face="Arial"  size="2" >                      
<A href="QPM_3.htm"><img src="SHG_ArrowPrev.bmp" alt="Previous topic"></A>&nbsp;
<A href="QPM_2.htm"><img src="SHG_ArrowTop.bmp" alt="First topic"></A>&nbsp;
<A href="links.htm"><img src="SHG_ArrowNext.bmp" alt="Next topic"></A>
    </font>                                             
  </td>                                                 
</tr></table>                                           
<hr><br>                                                
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 05.03 build 0005</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se <b>actualiza el utilitario UPX</b> a la &uacute;ltima versi&oacute;n disponible (3.08w) debido a que la versi&oacute;n anterior no compacta los ejecutables creados con HMG Oficial 3.0.40.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 05.03 build 0004</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se corrige la p&eacute;rdida de la configuraci&oacute;n de EXTRA RUN que se produce al cambiar de versi&oacute;n.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b> Bit&aacute;cora de cambios de la version 05.03 build 0003</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se agrega soporte para las librer&iacute;as de <b>HGM Oficial 3.x</b> ubicadas en la carpeta harbour/lib/win/mingw<br>
- Se agrega un <b>par&aacute;metro para diferenciar el uso de Harbour 3.0 de Harbour 3.1</b>.<br>
- Se corrige la falta de los mensajes de error del compilador Harbour 3.0 en el log de procesamiento.<br>
- Se corrige la imposibilidad de ejecutar el proyecto cuando no est&aacute; marcada la opci&oacute;n de moverlo a otra carpeta.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 05.03 build 0002</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se corrige la falta de los mensajes de error del compilador Harbour 3.1 en el log de procesamiento.<br>
- Los ejecutables auxiliares distribuidos con QPM ya no est&aacute;n compactados con UPX debido a que algunos antivirus generan p&eacute;rdidas importantes de performance en algunas configuraciones. Si el usuario lo desea puede compactarlos manualmente.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 05.03 build 0001</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se corrige la imposibilidad de crear el proyecto cuando la opci&oacute;n UPX est&aacute; marcada.<br>
- Se mejora la presentaci&oacute;n del log de procesamiento.<br>
- Se eliminan archivos US_A*.EXE y US_S*.EXE (bitmaps disfrazados) ya que se incorporan a los recursos del ejecutable.<br>
- Se corrige la falta de creaci&oacute;n del archivo QPM_version.path cuando no existe.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 05.02 build 0005</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- La <b>compilaci&oacute;n con MinGW </b>ahora utiliza un archivo de comandos para eliminar limitaciones en el n&uacute;mero de objetos que se pueden incluir en la l&iacute;nea de comandos.<br>
- Se mejora ligeramente la performance al generar un nuevo ejecutable.<br>
- Se agrega la posibilidad de <b>ejecutar la aplicaci&oacute;n a&uacute;n cuando se haya movido o renombrado el ejecutable</b>.<br>
- Peque&ntilde;as correcciones y mejoras en mensajes.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 05.02 build 0004</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se agrega la posibilidad de<b> borrar la lista de &uacute;ltimos proyectos abiertos</b>.<br>
- Se elimina el <b>mensaje </b>relacionado a un <b>bug </b>en HMG Extended cuando se cierra un di&aacute;logo con Esc.<br>
- El proceso de <b>migraci&oacute;n </b>a una nueva versi&oacute;n es ahora capaz de migrar la informaci&oacute;n de Hot Recovery desde las versiones de <b>QAC 4.x o anteriores</b>.<br>
- Se corrige la funcionalidad "Search" que hab&iacute;a dejado de funcionar cuando se cambiaron los compiladores de QPM.<br>
- Se corrigen las im&aacute;genes y los botones que no se muestran correctamente desde que se cambiaron los compiladores de QPM.<br>
- Se modifica la informaci&oacute;n de soporte de QPM.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 05.02 build 0001</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se modifican las librer&iacute;as linkeditadas por defecto para corregir un error al compilar con HMG Extended y Harbour.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 05.01 build 0000</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se corrige la falta de borrado de los archivos *_temp.rc.<br>
- Se corrige una cancelaci&oacute;n que se produce en "Global Settings" cuando se arma una combinaci&oacute;n inv&aacute;lida de compilador y librer&iacute;as.<br>
- Se agrega la posibilidad de <b>compilar con MinGW y HMG Extended</b>.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b> Bit&aacute;cora de cambios de la version 05.00 build 0001</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se renombr&oacute; QAC como <b>QPM </b>(QAC based Project Manager).<br>
- Se liber&oacute; QPM como <b>Open Source</b>.<br>
- Se cre&oacute; el nuevo <b>sitio en SourceForge</b>: <A href="http://qpm.sourceforge.net" target=blank>http://qpm.sourceforge.net</A><br>
- Se designa un <b>nuevo l&iacute;der del proyecto</b>: </font><b><font face="Arial" color="#FF0000" size=2>Fernando Yurisich</b></font><font face="Arial" color="#000000" size=2>.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 04.12 build 0000</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Adaptaciones varias para el soporte de <b>Oficial MiniGui 3.x</b>.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 04.11 build 0016</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se agreg&oacute; la posibilidad de hacer <b>override de los par&aacute;metros por default de Compilaci&oacute;n y Linkedici&oacute;n</b>.  Esta facilidad est&aacute; disponible desde la pesta&ntilde;a "Log Build Process".<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 04.11 build 0011</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se agreg&oacute; un bot&oacute;n para <b>Run </b>cuando el proceso de compilaci&oacute;n finaliza sin errores.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 04.10 build 02</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- <b>Se modific&oacute; la ubicaci&oacute;n</b> en donde QPM almacenaba el archivo de configuraci&oacute;n global y la base de Hot Recovery Version pasando del directorio en donde est&aacute; instalado Windows al directorio en donde est&aacute; instalado QPM.  Esto favorece el uso de QPM en <b>medios portables</b>.<br>
- Se corrigi&oacute; un problema en la creaci&oacute;n de la base de Simple Help Generation cuando se usaban algunos caracteres especiales en el nombre del proyecto (por ej: @ - ).<br>
- Se agreg&oacute; la opci&oacute;n para <b>crear nuevos proyectos de QPM</b> desde el explorador de Windows, presionando el bot&oacute;n derecho del mouse sobre un &aacute;rea vac&iacute;a y eligiendo la opci&oacute;n NEW (la primera vez requiere reiniciar Windows Explorer).<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 04.09 build 07</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se corrigi&oacute; un problema en la creaci&oacute;n de librer&iacute;as con Borland C y Pelles C.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 04.09 build 06</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se corrigieron los nombres de algunas librer&iacute;as debido a cambios en Harbour.<br>
- Se incorpor&oacute; una facilidad para hacer el seguimiento de la Version, Release y Build de nuestros proyectos.  <b>Aprender m&aacute;s sobre este tema</b>: <A href="PrjVersion.htm">Versionado de nuestros proyectos</A>.<br>
- Se agreg&oacute; un control para evitar que se pueda abrir el mismo proyecto desde dos instancias distintas de QPM.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 04.07 build 00</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se reorganizaron las librer&iacute;as para compilar y linkeditar con Oficial MiniGui 2.5.5 debido a cambios ocurridos en Harbour.<br>
- Se reorganizaron las librer&iacute;as para compilar y linkeditar con Extended MiniGui 1.5 build 54 debido a cambios ocurridos en Harbour.<br>
- Se reorganizaron las librer&iacute;as para compilar y linkeditar con OOHG del 14 de Agosto de 2008 debido a cambios ocurridos en Harbour.<br>
- Se <b>agreg&oacute; una opci&oacute;n</b> identificada con un bot&oacute;n con la letra </font><b><font face="Arial" color="#FF0000" size=2>"H"</b></font><font face="Arial" color="#000000" size=2> en las pesta&ntilde;as de Sources, Headers y Forms que fuerza la toma de una nueva versi&oacute;n de <b>Hot Recovery Version</b> y permite poner un comentario en el momento.  Esto es ideal para poner un punto de retorno cuando se encara un cambio de un fuente que podr&iacute;a no ser exitoso, ya que luego se puede hacer una vuelta atr&aacute;s r&aacute;pida a partir de dicha versi&oacute;n.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 04.06 build 02</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se corrigi&oacute; un problema con la registraci&oacute;n automatica del utilitario de comparaci&oacute;n de la facilidad Hot Recovery Versions.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 04.06 build 00</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se incorpora la facilidad de recuperaci&oacute;n de fuentes que han sido modificados (sources, headers y forms).  <b>Aprender m&aacute;s sobre este tema</b>: <A href="HotRecovery.htm">Hot Recovery Versions</A>.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 04.00 build 04</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se corrigi&oacute; un error al retornar de las tools de manejo de forms.<br>
- Se corrigi&oacute; la creaci&oacute;n vacia de elementos de tipo header.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 04.00 build 02</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se optimiz&oacute; el proceso de apertura/creaci&oacute;n de proyectos.<br>
- Se optimiz&oacute; el proceso de creaci&oacute;n de nuevo PRG: antes lo generaba vac&iacute;o y ahora genera un programa b&aacute;sico de ejemplo.<br>
- Se agreg&oacute; la opci&oacute;n de elegir el driver (DBFCDX o DBFNTX) para la creaci&oacute;n de nuevas tablas DBF vac&iacute;as.<br>
- Se agreg&oacute; la posibilidad de forzar siempre la recompilaci&oacute;n de uno o mas m&oacute;dulos de nuestra aplicaci&oacute;n.<br>
<b>Aprender m&aacute;s sobre este tema</b>: <A href="ForceRecomp.htm">&iquest;C&oacute;mo forzar autom&aacute;ticamente la recompilaci&oacute;n de m&oacute;dulos?</A><br>
- Se agreg&oacute; la posibilidad de consultar desde el programa del usuario la versi&oacute;n de QPM con que se ha compilado dicho programa.<br>
<b>Aprender m&aacute;s sobre este tema</b>: <A href="ObtenerQPMVersion.htm">Obtener la versi&oacute;n de QPM que ha compilado mi programa</A>.<br>
- Se document&oacute; una posibilidad para obtener la Fecha y Hora de generaci&oacute;n de nuestro m&oacute;dulo ejecutable desde el mismo ejecutable.<br>
<b>Aprender m&aacute;s sobre este tema</b>: <A href="LinkDateTime.htm">Como obtener la fecha y hora de Linkedici&oacute;n de nuestro EXE</A>.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 03.09 build 09</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se corrigi&oacute; un problema con el reconocimiento autom&aacute;tico de formatos (<b>FMG</b>) generados con <b>HMI+ Plus</b>.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 03.09 build 08</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se corrigi&oacute; un problema con las <b>resoluciones de pantalla</b> en la pesta&ntilde;a de DBF's.<br>
- Se corrigi&oacute; un problema de visualizacion de la pantalla de QPM cuando se tiene <b>activada la barra de tareas en forma fija</b>, es decir, que no se oculta autom&aacute;ticamente.<br>
- Se corrigi&oacute; un problema generado con la inclusi&oacute;n de la nueva <b>librer&iacute;a TIP de Harbour</b> para manejo de sockets.<br>
- Se modific&oacute; el <b>nombre de la instancia QPM.exe</b> para que cuando hay varias instancias activadas se pueda identificar mas f&aacute;cilmente a que proyecto pertenece cada una de ellas.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 03.09 build 00</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se agreg&oacute; soporte para compilar <b>OOHG</b> con <b>MinGW</b> y con <b>Pelles C</b>. El agregado de <b>Pelles C</b> oblig&oacute; a la creaci&oacute;n y/o adaptaci&oacute;n de los siguientes subprocesos:</font><br>
<li><font face="Arial" color="#000000" size=2>Generaci&oacute;n de librerias.</font></li>
<li><font face="Arial" color="#000000" size=2>Generaci&oacute;n de librer&iacute;as de interface para acceso a DLL's.</font></li>
<li><font face="Arial" color="#000000" size=2>Listador de funciones de librer&iacute;as.</font></li>
<font face="Arial" color="#000000" size=2>- Debido a las nuevas opciones de compilaci&oacute;n se reestructur&oacute; la nomenclatura de sufijos para hacerla mas entendible.  <b>Aprender m&aacute;s sobre este tema</b>: <A href="projectsettings.htm#sufijo">Manejo de sufijos</A>.<br>
- Se agreg&oacute; la posibilidad de hacer <b>Build+Run</b> en una sola operaci&oacute;n.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 03.03 build 03</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se agreg&oacute; un chequeo previo a la compilaci&oacute;n para detectar si el programa que queremos generar esta siendo ejecutado para prevenir una linkedici&oacute;n fallida.<br>
- Se agreg&oacute; la posibilidad de generar <b>Librer&iacute;as de Interface</b> a <b>DLL</b> mediante el m&eacute;todo <b>ReImport</b>, requerido para que funcione la capa de acceso a <b>MySql </b>con <b>Oficial MiniGui 3.x</b> y <b>MinGW</b>.  <b>Aprender m&aacute;s sobre este tema</b>: <A href="interface.htm">&iquest;C&oacute;mo generar la libreria para uso de DLL's?</A><br>
- Se agreg&oacute; la opci&oacute;n <b>'</b></font><b><font face="Arial" color="#FF0000" size=2>-a</b></font><b><font face="Arial" color="#000000" size=2>'</b> para la creaci&oacute;n de librer&iacute;as de interface para <b>BorlandC</b>; este par&aacute;metro fuerza el agregado de un gui&oacute;n bajo delante del nombre de las funciones dentro de la librer&iacute;a de interface que se genere. Uno de sus usos es la creaci&oacute;n de la librer&iacute;a de Interface para la DLL de <b>ADS</b>.<br>
<b>Aprender m&aacute;s sobre este tema</b>: <A href="interface.htm">&iquest;C&oacute;mo generar la libreria para uso de DLL's?</A><br>
- Se revis&oacute; el m&eacute;todo de construcci&oacute;n de la capa de acceso a <b>MySql</b> para que trabaje con todas las versiones de MiniGui (incluida <b>Oficial MiniGui 3.x</b> y <b>MinGW</b>).  <b>Aprender m&aacute;s sobre este tema</b>: <A href="mysql.htm">&iquest;C&oacute;mo construir la interface para acceder a MySql?</A><br>
- Se agreg&oacute; la posiblilidad de hacer browse del archivo resultante de la ejecuci&oacute;n del <b>preprocesador</b> de [x]Harbour (archivo <b>.ppo</b>) para cada <b>prg</b> de nuestro proyecto.  <b>Aprender m&aacute;s sobre este tema</b>: <A href="OtrasOpciones.htm#preprocesador">Resultado del PreProcesador de [x]Harbour</A><br>
- Se agreg&oacute; la posibilidad de ver el n&uacute;mero de l&iacute;nea de los fuentes de nuestro proyecto.  <b>Aprender m&aacute;s sobre este tema</b>: <A href="OtrasOpciones.htm#numeracion">Numeraci&oacute;n de Fuentes</A><br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 03.03 build 00</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se integr&oacute; el utilitario <b>US_Killer.exe</b> (dej&oacute; de existir como tal) dentro del fuente de <b>QPM</b>, de este modo, la reacci&oacute;n o apertura de dicho utilitario es instant&aacute;nea.  No se utiliza m&aacute;s la librer&iacute;a <b>procinfo.lib</b> de </font><b><font face="Arial" color="#FF0000" size=2>Grigory Filatov</b></font><font face="Arial" size=2> (<A href="mailto:gfilatov@freemail.ru">gfilatov@freemail.ru</A>)</font><font face="Arial" color="#000000" size=2>.<br>
<font face="Arial" color="#000000" size=2><b>Aprender m&aacute;s sobre este tema</b>: <A href="OtrasOpciones.htm#killtask">Kill Task</A><br>
- Se agreg&oacute; la lista hist&oacute;rica de proyectos abiertos recientemente en el menu <b>File</b> y en el bot&oacute;n <b>Open/New</b>.<br>
- Se agreg&oacute; un nuevo ejemplo sobre controles <b>ActiveX</b>, esta vez se hizo foco en controles que <b>utilizan parte de la pantalla de nuestra aplicaci&oacute;n</b>.  El ejemplo consiste en crear una aplicaci&oacute;n que utilice el control <b>Web Explorer</b> que provee Windows.<br>
Aprender m&aacute;s sobre este tema: <A href="ocxweb.htm">OCX con manejo de pantalla - &iquest;C&oacute;mo agregar un control Web Explorer a nuestra aplicaci&oacute;n?</A><br>
- Se corrigieron los fuentes para generar la interface <b>mySql</b> que habian dejado e funcionar debido a un cambio en las &uacute;ltimas versiones de Harbour. Colaboraci&oacute;n de </font></font><b><font face="Arial" color="#FF0000" size=2>Ciro Vargas Clemow</b></font><font face="Arial" color="#000000" size=2>.<br>
- Se actualiz&oacute; la concatenacion de librerias para la nueva versi&oacute;n de <b>xHarbour</b> 0.99.70.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 03.02 build 01</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se agreg&oacute; la funcionalidad de <b>Kill Task</b> para terminar nuestros programas cuando est&eacute;n en loop o no respondan sin necesidad de invocar al <b>TaskManager</b> de Window.  Basado en el sample <b>Killer Task</b> de </font><b><font face="Arial" color="#FF0000" size=2>Grigory Filatov</b></font><font face="Arial" size=2> (<A href="mailto:gfilatov@freemail.ru">gfilatov@freemail.ru</A>)</font><font face="Arial" color="#000000" size=2>.<br>
<b>Aprender m&aacute;s sobre este tema</b>: <A href="OtrasOpciones.htm#killtask">Kill Task</A><br>
- Se agreg&oacute; una nueva funcionalidad transparente para el usuario que permite hacer <b>debug</b> de programas con <b>fuentes en diferentes directorios</b>.<br>
Aprender m&aacute;s sobre este tema: <A href="OtrasOpciones.htm#debug">Debug</A><br>
- Se actualiz&oacute; el <b>Sample</b> de la librer&iacute;a de <b>Sockets</b>.<br>
- Se agreg&oacute; documentaci&oacute;n sobre controles <b>ActiveX</b> y <b>MiniGui</b>.<br>
<b>Aprender m&aacute;s sobre este tema</b>: <A href="activex.htm">OCX - &iquest;C&oacute;mo usar componentes ActiveX en nuestra aplicaci&oacute;n?</A><br>
- Se actualiz&oacute; el utilitario <b>UPX</b> de compresi&oacute;n de <b>Ejecutables</b> de version <b>1.25w</b> a <b>2.02w</b> de Agosto de 2006.<br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 03.01 build 00</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se corrigi&oacute; un problema con la llamada al utilitario <b>DbAlite</b>.<br>
- A partir de este build, el archivo de <b>recursos </b>del proyecto deber&aacute; residir en el <b>mismo folder </b>que reside el fuente principal del proyecto.<br>
- Se agreg&oacute; la posibilidad de suprimir las <b>comillas</b> en el nombre de las <b>DBF</b> cuando se invoca a herramientas externas de manejo de <b>DBF</b>.  <br>
<b>Aprender m&aacute;s sobre este tema</b>: <A href="ConfiguracionesGlobales.htm#dbfcomillas">Suspender Comillas</A><br>
- Se reagruparon los fuentes para generar las <b>Librer&iacute;as</b> para acceso a <b>DLL's</b>.<br>
<b>Aprender m&aacute;s sobre este tema</b>: <A href="interface.htm">&iquest;C&oacute;mo generar la libreria para uso de DLL's?</A><br>
- Se agregaron los fuentes y una explicaci&oacute;n para crear la librer&iacute;a <b>ClipWks</b>.  Se provee un ejemplo muy simple.<br>
<b>Aprender m&aacute;s sobre este tema</b>: <A href="clipwks.htm">&iquest;C&oacute;mo construir esta librer&iacute;a para manejar planillas de c&aacute;lculo?</A><br>
- Se agregaron los fuentes y una explicaci&oacute;n para crear las librer&iacute;as para acceso a <b>MySql</b>. <br>
<b>Aprender m&aacute;s sobre este tema</b>: <A href="mysql.htm">&iquest;C&oacute;mo construir la interface para acceder a MySql?</A><br>
- Se agregaron los fuentes y una explicaci&oacute;n para crear la librer&iacute;a <b>Socket</b> de <b>Matteo Baccan</b>. <br>
<b>Aprender m&aacute;s sobre este tema</b>: <A href="socket.htm">&iquest;C&oacute;mo construir la librer&iacute;a de Matteo Baccan?</A><br>
- Se agreg&oacute; un ejemplo en modo gr&aacute;fico para el uso de la librer&iacute;a <b>HbComm</b>, gentileza de </font><b><font face="Arial" color="#FF0000" size=2>Marcelo Torres </b></font><b><font face="Arial" color="#000000" size=2><A href="mailto:lichitorres@yahoo.com.ar">lichitorres@yahoo.com.ar</A><br>
Aprender m&aacute;s sobre este tema</b>: <A href="hbcomm.lib.htm">&iquest;C&oacute;mo construir la librer&iacute;a HbComm para comunicaciones?</A><br>
- Se agregaron nuevos t&oacute;picos en la <b>Ayuda</b>.<br>
- Se expandi&oacute; la opci&oacute;n de <b>Suspend Control Edit </b>a la edici&oacute;n de <b>Headers</b> y <b>Forms</b>.<br>
<b>Aprender m&aacute;s sobre este tema</b>: <A href="ConfiguracionesGlobales.htm#suspend">Suspend Control Edit</A><br>
- Peque&ntilde;as correcciones.</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la version 03.00 build 08</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se agreg&oacute; la facilidad de visualizaci&oacute;n del <b>ErrorLog.htm</b> que genera <b>MiniGui </b>cuando el programa que estamos desarrollando <b>cancela</b> en su ejecuci&oacute;n.<br>
<b>Aprender m&aacute;s sobre este tema</b>: <A href="OtrasOpciones.htm#errorlog">ErrorLog</A><br>
- Se corrigi&oacute; la facilidad de <b>Stop Build</b> que no finalizaba cuando el programa que se estaba compilando ten&iacute;a un error.<br>
- Se corrigi&oacute; el mensaje de asistencia para cuando se desea recompilar un programa que est&aacute; en uso y que no ha sufrido cambios en su fuente.<br>
- Se optimiz&oacute; el proceso de generaci&oacute;n de <b>help en formato HTML</b>.<br>
- Se corrigi&oacute; la <b>rutina de listado</b> de librerias de <b>MinGW (.A)</b>.<br>
- Se corrigi&oacute; un problema con la resoluci&oacute;n de pantallas <b>widescreen</b>.<br>
<font face="Arial" color="#000000">- Se agreg&oacute; la opci&oacute;n de <b>Suspend Control Edit</b> para quien no quiera que QPM realice un control sobre los archivos que se estan editando.  Esta facilidad provocaba problemas con algunos editores de texto.<br>
<b>Aprender m&aacute;s sobre este tema</b>: <A href="ConfiguracionesGlobales.htm#suspend">Suspend Control Edit</A><br>
- Peque&ntilde;as correcciones.</font></font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><font face="Arial" color="#000000"><b>Bit&aacute;cora de cambios de la versi&oacute;n 03.00 build 00</b></font></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se agreg&oacute; el m&oacute;dulo <b>SHG (Simple Help Generator)</b> (Generador Simple de archivos de Ayuda en formato <b>CHM</b> y <b>HTML</b>). </font><b><font face="Arial" color="#FF0000" size=2>No requiere el uso de Microsoft Help Workshop.</b></font><br>
<font face="Arial" color="#000000" size=2>- Se agreg&oacute; <b>Manejo de DBF</b>'s.<br>
- Se agreg&oacute; una funci&oacute;n de <b>B&uacute;squedas globales</b> en Sources, Forms, Headers y DBF&acute;s.<br>
- Se agreg&oacute; una funci&oacute;n de <b>Visualizaci&oacute;n r&aacute;pida </b>de Sources, Forms, Headers y DBF's.<br>
- Se agreg&oacute; la posibilidad de emitir un <b>Listado de funciones en una librer&iacute;a</b>.<br>
- Se agreg&oacute; la posibilidad de emitir un <b>Listado de las caracter&iacute;sticas del ejecutable o la librer&iacute;a</b> constru&iacute;da.<br>
- Se agreg&oacute; la posibilidad de ejecutar el <b>Run con Par&aacute;metros</b>.<br>
- Se agreg&oacute; la posibilidad de hacer <b>Copy/Paste </b>con men&uacute; contextual en todos los visores y editores.<br>
- Prov&eacute;e ejecutable de <b>DBFView</b> escrito por </font><b><font face="Arial" color="#FF0000" size=2>Grigory Filatov</b></font><font face="Arial" color="#000000" size=2> (Open Source).<br>
- Se agreg&oacute; la posibilidad de <b>editar DBF's</b> con cualquier otra herramienta que soporte el nombre de la DBF como par&aacute;metro.<br>
- Se agreg&oacute; una funci&oacute;n de <b>Control de Edici&oacute;n</b> de Sources, Forms, Headers y DBF's.<br>
- Se agreg&oacute; la posibilidad de hacer <b>Stop Build </b>para compilaciones incrementales de mas de un PRG.<br>
- Se agreg&oacute; <b>Ayuda</b> en espa&ntilde;ol.<br>
- Se agreg&oacute; un <b>Nuevo ejemplo</b> para <b>Simple Help Generator y uso de archivos CHM</b> desde aplicaciones MiniGui.<br>
- Se agreg&oacute; la posibilidad de ejecutar <b>QPM</b> en <b>batch</b>.<br>
- Se agreg&oacute; la posibilidad de que <b>QPM</b> ejecute <b>procesos extra</b> (<b>extra run</b>) cuando el proceso de generaci&oacute;n (build) termina <b>OK (</b>estos procesos pueden ser programas <b>ejecutables</b>, <b>batch</b>, <b>comandos de consola</b> u otra instancia de <b>QPM</b>).</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Bit&aacute;cora de cambios de la versi&oacute;n 02.00 build 00</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Se ha agregado la posibilidad de incluir archivos fuentes que residan en <b>diferentes directorios</b>.<br>
- Se ha agregado la posibilidad de compilar <b>C&oacute;digo C</b> en forma nativa.<br>
- Se ha incorporado la creacion de aplicaciones <b>modo Consola y Mixtas</b>.<br>
- Se ha incorporado el utilitario <b>UPX</b> para compresi&oacute;n de archivos ejecutables.<br>
- Se han incorporado funciones de <b>Rename</b> y <b>Copy/Move</b> del archivo resultante del proceso (Exe o Lib).<br>
- <b>Nuevos ejemplos</b> para creaci&oacute;n de aplicaciones en <b>modo Consola y Mixtas</b>.<br>
- Se ha agregado el control de <b>referencias cruzadas entre Fuentes y Headers</b>.<br>
- Se ha agregado el control de <b>referencias cruzadas entre Fuentes y Forms</b>.<br>
- <b>Creaci&oacute;n de Librer&iacute;as</b> con <b>TODAS</b> las versiones de MiniGUI's</font><br>
<br>
<br>
<li><font face="Arial" color="#000000" size=2><b>Version Inicial 01.00 build 00</b></font></li>
<font face="Arial" color="#000000" size=2>.<br>
- Compilaci&oacute;n con <b>MiniGui Oficial 1.x </b><br>
- Compilaci&oacute;n con <b>MiniGui Experimental 1.x </b><br>
- Compilaci&oacute;n con <b>MiniGui Oficial 3.x </b><br>
- Compilaci&oacute;n con <b>OOHG preRelease (Object Oriented Harbour GUI)</b><br>
- Soporte para modificador de FORMS <b>HMI+</b> de </font><b><font face="Arial" color="#FF0000" size=2>Ciro Vargas Clemow</b></font><font face="Arial" color="#000000" size=2> (1.62 o superior)<br>
- Soporte para modificador de FORMS <b>HMGS-IDE</b> (Open Source) de </font><b><font face="Arial" color="#FF0000" size=2>Walter Formigoni</b></font><font face="Arial" color="#000000" size=2> (0.0.7 o superior)</font><br>
 
<p><hr><p>                                                            
<table width=100%><tr><td align="center"><b><font face="Arial" size=2><IMG SRC="QPM.bmp">   QPM</font></b><font face="Arial" size=2> (QAC Based Project Manager) </font><b><font face="Arial" color="#0000FF" size=2>Version 05.03</b></font><br>
<br>
<font face="Arial" color="#E20362" size=2><i><b>Compilaci&oacute;n Incremental con las tres versiones de librer&iacute;as mas populares de la familia MiniGui: Oficial MiniGui, Extended MiniGui y Object Oriented Harbour Gui (OOHG)</b></i></font><br>
<br>
<b><font face="Arial" size=2><A href=https://lists.sourceforge.net/lists/listinfo/qpm-users/>Haz clic aqu&iacute; para unirte a la lista de usuarios en SourceForge</A></font><br>
<br>
<font face="Arial" color="#0000FF" size=2><A href="http://qpm.sourceforge.net" target=blank>Haz clic aqu&iacute; para visitar el sitio del proyecto: qpm.sourceforge.net</A></font></b></td></tr></table><br>
<br>
<br>
<br>
 

<table width="100%"  border="0"  cellspacing="0"  cellpadding="2"  bgcolor="#c0c0c0" > 
  <TBODY>                                                             
  <tr>                                                                
    <td align="left" ><font face="Arial"  color="#010101"  size="4" ><span style="FONT-SIZE: 14pt"
     >                                                                
      <P>                                                             
      <P align=left><FONT size=2><A href="http://qpm.sourceforge.net" target=blank>Powered by QPM</A>&nbsp;&nbsp;</FONT>               
      </P></span></font></td>                                         
    <td align="right" >                                               
      <font face="Arial"  size="2" >                                  
<A href="QPM_3.htm"><img src="SHG_ArrowPrev.bmp" alt="Previous topic"></A>&nbsp;
<A href="QPM_2.htm"><img src="SHG_ArrowTop.bmp" alt="First topic"></A>&nbsp;
<A href="links.htm"><img src="SHG_ArrowNext.bmp" alt="Next topic"></A>
      </font>                                                         
    </td></tr></TBODY></table><hr></body></html>                          