<html><head>                                            
<title>¿Cómo se especifican las características del nuevo proyecto?</title>       
</head>                                                 
<body bgcolor="#FFFCEA" >                        
<DIV></DIV>                                             
<table width="100%"  border="0"  cellspacing="0"  cellpadding="2"  bgcolor="#c0c0c0" >
<tr>                                                    
  <td align="left" >                                    
    <div align="left" ><font face="Arial"  color="#010101"  size="4" ><span style="FONT-SIZE: 14pt"
   >¿Cómo se especifican las características del nuevo proyecto?</span></font></div>  
  </td>                                                 
  <td align="right" >                                   
    <font face="Arial"  size="2" >                      
<A href="ConfiguracionesGlobales.htm"><img src="SHG_ArrowPrev.bmp" alt="Previous topic"></A>&nbsp;
<A href="QPM_2.htm"><img src="SHG_ArrowTop.bmp" alt="First topic"></A>&nbsp;
<A href="QPM_21.htm"><img src="SHG_ArrowNext.bmp" alt="Next topic"></A>
    </font>                                             
  </td>                                                 
</tr></table>                                           
<hr><br>                                                
<font face="Arial" color="#000000" size=2>Las caracter&iacute;sticas del proyecto se especifican en la pantalla que aparece a continuaci&oacute;n de crear un nuevo proyecto, o accediendo a la opci&oacute;n "<b>Project Opctions</b>" del men&uacute; "Settings", se pueden especificar las caracteristicas del proyecto y las acciones complementarias que se pueden realizar.<br>
<br>
<b><IMG SRC="QPM_ProjectSettings.png" BORDER=2></b><br>
<br>
<b>Compiler:</b> Selecci&oacute;n del tipo de compilador de la familia [x]Harbour y compilador C<br>
<br>
<b>GUI Library:</b> Selecci&oacute;n de la librer&iacute;a gr&aacute;fica a utilizar en conjunci&oacute;n con el compilador [x]Harbour seleccionado<br>
<br>
<b>Output Type:</b> Tipo de componente que se crear&aacute; con el proyecto.<br>
<br>
<i>Executable:</i> Ejecutable para Windows 32 bit.<br>
<br>
<i>Library:</i> Librer&iacute;a de funciones, si la librer&iacute;a gr&aacute;fica utiliza Borland C como compilador, se crear&aacute; una librer&iacute;a de extenci&oacute;n "LIB". Si la Librer&iacute;a Gr&aacute;fica requiere el uso del compilador MinGW se crear&aacute; una librer&iacute;a de extension "A" y prefijada con el texto "LIB", es decir, si partimos del fuente MyLib.prg se crear&aacute; la librer&iacute;a MyLib.Lib en el primer caso y LibMyLib.A en el segundo caso.<br>
<br>
<i>Interface Library:</i> Con esta opci&oacute;n es posible construir una libreria para acceder mas facilmente a las funciones de una DLL.  Aprenda mas sobre este tipo de librerias en el t&oacute;pico: <A href="interface.htm">&iquest;C&oacute;mo crear una Librer&iacute;a de Interface para acceso a DLL's?</A><br>
<br>
<i>UPX:</i> Esta opci&oacute;n determina si el ejecutable resultante del proyecto ser&aacute; comprimido con el utilitario UPX. El promedio de compresi&oacute;n es aproximadamente de un 60% y no requiere descompresi&oacute;n previa para ejecutar el ejecutable comprimido.<br>
<br>
<b>Output Rename:</b> Estas opciones permiten cambiar el nombre el modulo resultante.<br>
<br>
<i>None:</i> No renombra el m&oacute;dulo<br>
<br>
<i>Rename To:</i> Renombra el modulo resultante con lo especificado en el textbox adjunta<br>
<br>
<i><A name="sufijo">Add Automatic Suffix:</i> Agrega un sufijo al nombre del modulo, renombrado o no. El sufijo que se agrega diferencia entre las diferentes GUI's, los diferentes compiladores C y Harbour o xHarbour.<br>
<br>
El sufijo se compone de 3 indicadores: </font><b><font face="Arial" color="#0000FF" size=2>??</b></font><b><font face="Arial" color="#FF0000" size=2>%</b></font><b><font face="Arial" color="#008000" size=2>$ </b></font><font face="Arial" color="#000000" size=2>d&oacute;nde:</font><br>
<br>
<font face="Arial" color="#0000FF" size=2><b>??</b></font><font face="Arial" color="#000000" size=2> es la version de MiniGui </font><br>
<font face="Arial" color="#0000FF" size=2><b>M1</b></font><font face="Arial" color="#000000" size=2> para Oficial MiniGui 1.x</font><br>
<font face="Arial" color="#0000FF" size=2><b>M3</b></font><font face="Arial" color="#000000" size=2> para Oficial MiniGui 3.x</font><br>
<font face="Arial" color="#0000FF" size=2><b>E1</b></font><font face="Arial" color="#000000" size=2> para Extended MiniGui 1.x</font><br>
<font face="Arial" color="#0000FF" size=2><b>O3</b></font><font face="Arial" color="#000000" size=2> para OOHG 3.x</font><br>
<br>
<font face="Arial" color="#FF0000" size=2><b>%</b></font><font face="Arial" color="#000000" size=2> es el compilador C</font><br>
<font face="Arial" color="#FF0000" size=2><b>B</b></font><font face="Arial" color="#000000" size=2> para Borland </font><br>
<font face="Arial" color="#FF0000" size=2><b>G</b></font><font face="Arial" color="#000000" size=2> para MinGW</font><br>
<font face="Arial" color="#FF0000" size=2><b>P</b></font><font face="Arial" color="#000000" size=2> para Pelles</font><br>
<br>
<font face="Arial" color="#008000" size=2><b>$</b></font><font face="Arial" color="#000000" size=2> es el compilador [x]Harbour</font><br>
<font face="Arial" color="#008000" size=2><b>H</b></font><font face="Arial" color="#000000" size=2> para Harbour</font><br>
<font face="Arial" color="#008000" size=2><b>X</b></font><font face="Arial" color="#000000" size=2> para xHarbour<br>
<br>
<br>
Por ejemplo, para el ejecutable MyExe.exe agregar&iacute;a lo siguiente<br>
<br>
MyExe<b>_M1BH</b>.exe para Oficial MiniGui 1.x con Borland y Harbour<br>
<br>
MyExe<b>_M1BX</b>.exe para Oficial MiniGui 1.x con Borland y xHarbour<br>
<br>
MyExe<b>_M3GH</b>.exe para Oficial MiniGui 3.x con MinGW y Harbour<br>
<br>
MyExe<b>_M3GX</b>.exe para Oficial MiniGui 3.x con MinGW y xHarbour<br>
<br>
MyExe<b>_E1BH</b>.exe para Extended MiniGui 1.x con Borland y Harbour<br>
<br>
MyExe<b>_E1BX</b>.exe para Extended MiniGui 1.x con Borland y xHarbour<br>
<br>
MyExe<b>_O3BH</b>.exe para OOHG 3.x con Borland y Harbour<br>
<br>
MyExe<b>_O3BX</b>.exe para OOHG 3.x con Borland y xHarbour<br>
<br>
MyExe<b>_O3GH</b>.exe para OOHG 3.x con MinGW y Harbour<br>
<br>
MyExe<b>_O3GX</b>.exe para OOHG 3.x con MinGW y xHarbour<br>
<br>
MyExe<b>_O3PH</b>.exe para OOHG 3.x con Pelles y Harbour<br>
<br>
MyExe<b>_O3PX</b>.exe para OOHG 3.x con Pelles y xHarbour<br>
<br>
<br>
<b>Output Copy/Move:</b> Estas opciones sirven para copiar o mover el modulo resultante del projecto hacia otro directorio<br>
<br>
<i>Copy to:</i> Copia el m&oacute;dulo resultante del proyecto al directorio especificado en el texbox adjunto<br>
<br>
<i>Move to:</i> Mueve el m&oacute;dulo resultante del proyecto al directorio especificado en el texbox adjunto y genera un archivo de tipo texto con informaci&oacute;n del destino a donde se ha movido el m&oacute;dulo. Por ejemplo, para el m&oacute;dulo <i>MyExe.exe</i> genera el archivo <i>MyExe.exe.MOVED.TXT</i><br>
<br>
<b>Tool for modify Forms:</b> Esta selecci&oacute;n nos permite elegir la herramienta que utilizaremos para confeccionar y modificar Formatos de Pantallas (Ventanas)<br>
<br>
<i>Automatic:</i> QPM determinar&aacute; con que producto fue creado el Form e intentar&aacute; abrirlo con la herramienta correspondiente (Recomendado)<br>
<br>
<i>HMI+:</i> QPM intentar&aacute; abrir el Form con el producto dise&ntilde;ado por Ciro Vargas Clemow llamado HMI+<br>
<br>
<i>HMGSIde:</i> QPM intentar&aacute; abrir el Form con el producto dise&ntilde;ado por Walter Formigoni llamado HMGSIde (Open Source)<br>
<br>
<b>Tool for modify DBF's:</b> Esta selecci&oacute;n nos permite elegir la herramienta que utilizaremos para crear y modificar bases de Datos de tipo DBF<br>
<br>
<i>DBFView:</i> QPM abrir&aacute; la DBF con el producto dise&ntilde;ado por Grigory Filatov llamado DBFView (Open Source)<br>
<br>
<i>User Select:</i> QPM abrir&aacute; la DBF con el producto seleccionado en los Seteos Globales de QPM (Se acceden desde la opci&oacute;n Global Options del menu Settings)<br>
<br>
<br>
<font face="Arial" color="#000000" size=2><b>Extra Run After Success Build:</b> En esta opci&oacute;n se pueden especificar una serie de acciones a realizar si la construcci&oacute;n del proyecto es exitosa.<br>
<br>
<i>None:</i> No ejecuta acci&oacute;n alguna.<br>
<br>
<i>Run Another QPM Instance:</i> Ejecuta otro QPM para realizar las acciones solicitadas sobre el proyecto seleccionado<br>
<br>
<b><IMG SRC="QPM_ExtraRun_01.png" BORDER=2></b><br>
<br>
OPEN: La acci&oacute;n ser&aacute; Abrir un proyecto y quedarse a la espera de lo que el usuario decida hacer.<br>
<br>
ForceFull: Especifica que luego de abrir el proyecto se limpien los m&oacute;dulos objeto para que la pr&oacute;xima compilaci&oacute;n se vuelvan a generar.<br>
<br>
BUILD: La nueva instancia de QPM abrir&aacute; el proyecto y luego ejecutar&aacute; el proceso de Build.<br>
<br>
Lite: La nueva instancia de QPM se presentar&aacute; con menos opciones en un formato minimalista.<br>
<br>
ForceFull: Especifica que luego de abrir el proyecto se limpien los m&oacute;dulos objeto para que el proceso de Build los vuelva a generar.<br>
<br>
Run: Si el Build fue exitoso ejecutar el m&oacute;dulo resultante.<br>
<br>
ButtonRun: Habilita el Boton Run (para ejecutar el proyecto todas las veces que sea necesario)<br>
<br>
Clear: Limpia todos los directorios de M&oacute;dulos Objetos (no borra el m&oacute;dulo resultante del proceso de build, que se elimina con Force Full). Existe un directorio para cada combinacion de [x]Harbour y MiniGui que se utilice. Nota: Force Full solo borra el directorio de la combinaci&oacute;n activa y el m&oacute;dulo resultante del proceso de Build.<br>
<br>
Log: Registra la actividad en un archivo de texto llamado con el nombre del proyecto seguido por la extensi&oacute;n LOG, es decir, para el proyecto MyProject.mpmQ generar&aacute; el archivo MyProject.log<br>
<br>
LogOnlyError: Registre en el archivo de Log solamente la informaci&oacute;n referida a errores.<br>
<br>
AutoExit: Cierra QPM despu&eacute;s de la acci&oacute;n solicitada.<br>
<br>
RUN: La nueva instancia de QPM ejecutar&aacute; el m&oacute;dulo ejecutable del proyecto seleccionado.<br>
<br>
Lite: La nueva instancia de QPM se presentar&aacute; con menos opciones en un formato minimalista.<br>
<br>
Clear: Limpia todos los directorios de M&oacute;dulos Objetos (no borra el m&oacute;dulo resultante del proceso de build, que se elimina con Force Full). Existe un directorio para cada combinacion de [x]Harbour y MiniGui que se utilice. Nota: Force Full solo borra el directorio de la combinaci&oacute;n activa y el m&oacute;dulo resultante del proceso de Build.<br>
<br>
Log: Registra la actividad en un archivo de texto llamado con el nombre del proyecto seguido por la extensi&oacute;n LOG, es decir, para el proyecto MyProject.mpmQ generar&aacute; el archivo MyProject.log<br>
<br>
LogOnlyError: Registre en el archivo de Log solamente la informaci&oacute;n referida a errores.<br>
<br>
AutoExit: Cierra QPM despu&eacute;s de la acci&oacute;n solicitada.<br>
<br>
CLEAR: La nueva instancia de QPM limpiar&aacute; todos los directorios temporales de m&oacute;dulos objetos.<br>
<br>
Lite: La nueva instancia de QPM se presentar&aacute; con menos opciones en un formato minimalista.<br>
<br>
ForceFull: Especifica que luego de abrir el proyecto se limpien los m&oacute;dulos objeto para que el proceso de Build los vuelva a generar.<br>
<br>
Log: Registra la actividad en un archivo de texto llamado con el nombre del proyecto seguido por la extensi&oacute;n LOG, es decir, para el proyecto MyProject.mpmQ generar&aacute; el archivo MyProject.log<br>
<br>
LogOnlyError: Registre en el archivo de Log solamente la informaci&oacute;n referida a errores.<br>
<br>
AutoExit: Cierra QPM despu&eacute;s de la acci&oacute;n solicitada.<br>
<br>
PROJECT: Utilizando el bot&oacute;n adjunto, elija el proyecto que utilizar&aacute; para la acci&oacute;n seleccionada.<br>
<br>
<i>Run EXE Program or Batch Process:</i> Permite la ejecuci&oacute;n de un programa o un proceso de comandos o programas en lote<br>
<br>
<b><IMG SRC="QPM_ExtraRun_02.png" BORDER=2></b><br>
<br>
Seleccione el programa o proceso con el bot&oacute;n adjunto<br>
<br>
Parameters: Par&aacute;metros que ser&aacute;n pasados al programa o proceso en tiempo de ejecuci&oacute;n (soporta variables QPM, ver mas adelante)<br>
<br>
Pause: Se utiliza solamente en procesos Batch y provoca una pausa luego de la ejecuci&oacute;n del ultimo comando de lote. <br>
<br>
<i>Execute Free Command:</i> Permite la ejecuci&oacute;n de un comando de D.O.S.<br>
<br>
<b><IMG SRC="QPM_ExtraRun_03.png" BORDER=2></b><br>
<br>
Especifique el comando D.O.S. (soporta variables QPM, ver mas adelante)<br>
<br>
Pause: Provoca una pausa luego de la ejecuci&oacute;n del comando.<br>
<br>
<i>TEST:</i> Para probar que es lo que har&iacute;a QPM en caso de ejecutar lo solicitado.</font></font><br>
<br>
 
<p><hr><p>                                                            
<table width=100%><tr><td align="center"><font face="Arial" color="#000000" size=2><b><IMG SRC="QPM.bmp"></b></font><b><font face="Arial" size=2>   QPM</b> (QAC Based Project Manager) </font><b><font face="Arial" color="#0000FF" size=2>Version 05.00</b></font><br>
<br>
<font face="Arial" color="#E20362" size=2><b><i>Compilaci&oacute;n Incremental con las tres versiones de librer&iacute;as mas populares de la familia MiniGui: Oficial MiniGui, Extended MiniGui y Object Oriented Harbour Gui (OOHG)</i></b></font><br>
<br>
<font face="Arial" size=2><b><A href="mailto:fernando.yurisich@gmail.com" >fernando.yurisich@gmail.com</A></b></font><br>
<br>
<font face="Arial" color="#0000FF" size=2><b><A href="http://qpm.sourceforge.net" target=blank>qpm.sourceforge.net</A></b></font></td></tr></table><br>
<br>
<br>
 

<table width="100%"  border="0"  cellspacing="0"  cellpadding="2"  bgcolor="#c0c0c0" > 
  <TBODY>                                                             
  <tr>                                                                
    <td align="left" ><font face="Arial"  color="#010101"  size="4" ><span style="FONT-SIZE: 14pt"
     >                                                                
      <P>                                                             
      <P align=left><FONT size=2><A href="http://qpm.sourceforge.net" target=blank>Powered by QPM</A>&nbsp;&nbsp;</FONT>               
      </P></span></font></td>                                         
    <td align="right" >                                               
      <font face="Arial"  size="2" >                                  
<A href="ConfiguracionesGlobales.htm"><img src="SHG_ArrowPrev.bmp" alt="Previous topic"></A>&nbsp;
<A href="QPM_2.htm"><img src="SHG_ArrowTop.bmp" alt="First topic"></A>&nbsp;
<A href="QPM_21.htm"><img src="SHG_ArrowNext.bmp" alt="Next topic"></A>
      </font>                                                         
    </td></tr></TBODY></table><hr></body></html>                          